tutorials/buoyantBoussinesqSimple4PCMFoam/cylinderInSquareEPCM/constant/EPCMProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      EPCMProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alphaEPCMEq	inactive;

omega		omega [ 0 0 0 0 0 0 0 ]		0.447;
lambda		lambda [ 0 0 0 0 0 0 0 ]	3;
DB		DB [ 0 2 -1 0 0 0 0 ]		1e-13;
DT		DT [ 0 2 -1 0 0 0 0 ]		1e-13;

//Thermal properties of EPCM's core
core
{
    rho		rho [ 1 -3 0 0 0 0 0 ]		778;
    Cp		Cp [ 0 2 -2 -1 0 0 0 ]		2380;
    kappa	kappa [ 1 1 -3 -1 0 0 0 ]	0.2;
    beta	beta [ 0 0 0 -1 0 0 0 ]		8.0e-4;
    hm		hm [ 0 2 -2 0 0 0 0 ]		251612;
    Tm		Tm [ 0 0 0 1 0 0 0 ]		317;
    Tmr		Tmr [ 0 0 0 1 0 0 0 ]		1.0;
}

//Thermal properties of EPCM's shell
shell
{
    rho		rho [ 1 -3 0 0 0 0 0 ]		1185;
    Cp		Cp [ 0 2 -2 -1 0 0 0 ]		1466;
    kappa	kappa [ 1 1 -3 -1 0 0 0 ]	0.2;
    beta	beta [ 0 0 0 -1 0 0 0 ]		4.4e-4;
    d		d [ 0 1 0 0 0 0 0 ]		50e-09;
}
// ************************************************************************* //
